OpenFOAM-2112/CyclicAMIChannel-M2-DES/constant/fvOptions
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

velocityDamping
{
    type            velocityDampingConstraint;
    selectionMode   all;
    UMax            10;
}
