OpenFOAM-2112/CyclicAMIChannel-M2-DES/0.model/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

pressure             0;
turbulentKE          1.53e-05;
turbulentEpsilon     1.85e-09;
turbulentOmega       1.35e-03;

// ************************************************************************* //
