OpenFOAM-2112/CyclicAMIChannel-M2-DES/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues (
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (3 0 -0.03)
);

regions (
    boxToCell {
        box (-1000 -1000 -1000) (1000 1000 2);

        fieldValues (
            volScalarFieldValue alpha.water 1
        );
    }
);

// ************************************************************************* //